{
  "projectId": "wwii-project-001",
  "metadata": {
    "title": "Segunda Guerra Mundial",
    "description": "Mapa mental sobre los principales eventos y aspectos de la Segunda Guerra Mundial (1939-1945)",
    "createdAt": 1729554000000,
    "updatedAt": 1729554000000,
    "version": "1.0.0"
  },
  "rootNodeId": "root",
  "nodes": {
    "root": {
      "id": "root",
      "title": "Segunda Guerra Mundial",
      "description": "La Segunda Guerra Mundial fue el conflicto militar más grande de la historia, que tuvo lugar entre 1939 y 1945. Involucró a la mayoría de las naciones del mundo, incluyendo todas las grandes potencias, organizadas en dos alianzas militares opuestas: los Aliados y las Potencias del Eje. Fue la guerra más mortífera de la historia, con más de 70 millones de víctimas, incluyendo civiles y militares.",
      "level": 0,
      "parentId": null,
      "position": { "x": 100, "y": 300 },
      "children": ["allies", "axis", "major-battles"],
      "isExpanded": false,
      "isVisible": true,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "allies": {
      "id": "allies",
      "title": "Aliados",
      "description": "Los Aliados fueron la coalición de países que se opusieron a las Potencias del Eje durante la Segunda Guerra Mundial. Las principales potencias aliadas fueron Estados Unidos, el Reino Unido, la Unión Soviética, China y Francia. Juntos, movilizaron más de 100 millones de soldados y coordinaron estrategias militares a través de conferencias como Yalta y Potsdam.",
      "level": 1,
      "parentId": "root",
      "position": { "x": 0, "y": 0 },
      "children": ["usa", "uk", "ussr"],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "usa": {
      "id": "usa",
      "title": "Estados Unidos",
      "description": "Estados Unidos entró oficialmente en la guerra el 8 de diciembre de 1941, tras el ataque japonés a Pearl Harbor. Aportó recursos industriales masivos, tecnología avanzada y millones de soldados. El programa Lend-Lease proporcionó suministros vitales a los aliados. Los estadounidenses lideraron campañas clave en el Pacífico contra Japón y participaron en la liberación de Europa Occidental, incluyendo el Día D en Normandía.",
      "level": 2,
      "parentId": "allies",
      "position": { "x": 0, "y": 0 },
      "children": [],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "uk": {
      "id": "uk",
      "title": "Reino Unido",
      "description": "El Reino Unido, bajo el liderazgo de Winston Churchill, fue uno de los únicos países europeos que resistió la ocupación nazi desde el principio. Sobrevivió a la Batalla de Inglaterra (1940), donde la RAF derrotó a la Luftwaffe alemana. Los británicos desempeñaron un papel crucial en el norte de África, la guerra naval en el Atlántico y la campaña de bombardeos estratégicos sobre Alemania. Su inteligencia militar, incluyendo el descifrado de Enigma en Bletchley Park, fue decisiva.",
      "level": 2,
      "parentId": "allies",
      "position": { "x": 0, "y": 0 },
      "children": [],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "ussr": {
      "id": "ussr",
      "title": "Unión Soviética",
      "description": "La Unión Soviética, bajo el liderazgo de Joseph Stalin, soportó el peso más pesado de la guerra contra Alemania en el Frente Oriental. Después de la Operación Barbarroja (1941), los soviéticos detuvieron el avance alemán en Stalingrado (1942-1943) y Kursk (1943). El Ejército Rojo luego avanzó hacia el oeste, liberando Europa del Este y capturando Berlín en mayo de 1945. Se estima que la URSS sufrió entre 20-27 millones de muertes, la mayoría del total de víctimas de la guerra.",
      "level": 2,
      "parentId": "allies",
      "position": { "x": 0, "y": 0 },
      "children": [],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "axis": {
      "id": "axis",
      "title": "Potencias del Eje",
      "description": "Las Potencias del Eje fueron la coalición liderada por Alemania, Italia y Japón, que buscaban expandir sus territorios y establecer un nuevo orden mundial. Firmaron el Pacto Tripartito en 1940, comprometiéndose a apoyarse mutuamente. Sus ideologías fascistas y militaristas los llevaron a cometer atrocidades masivas, incluyendo el Holocausto y crímenes de guerra en Asia.",
      "level": 1,
      "parentId": "root",
      "position": { "x": 0, "y": 0 },
      "children": ["germany", "italy", "japan"],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "germany": {
      "id": "germany",
      "title": "Alemania Nazi",
      "description": "Bajo el liderazgo de Adolf Hitler y el Partido Nazi, Alemania inició la guerra invadiendo Polonia el 1 de septiembre de 1939. Utilizó la táctica de Blitzkrieg (guerra relámpago) para conquistar rápidamente gran parte de Europa. La Alemania Nazi implementó el Holocausto, resultando en el genocidio de 6 millones de judíos y millones de otras víctimas. Su derrota final llegó con la caída de Berlín y el suicidio de Hitler el 30 de abril de 1945.",
      "level": 2,
      "parentId": "axis",
      "position": { "x": 0, "y": 0 },
      "children": [],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "italy": {
      "id": "italy",
      "title": "Italia Fascista",
      "description": "Italia, bajo Benito Mussolini, se unió a la guerra del lado alemán en junio de 1940. Combatió principalmente en el norte de África y los Balcanes, pero sufrió derrotas significativas. La invasión aliada de Sicilia en 1943 llevó a la caída de Mussolini. Italia se rindió en septiembre de 1943 y posteriormente se unió a los Aliados, aunque el norte del país permaneció bajo control alemán hasta 1945.",
      "level": 2,
      "parentId": "axis",
      "position": { "x": 0, "y": 0 },
      "children": [],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "japan": {
      "id": "japan",
      "title": "Imperio de Japón",
      "description": "Japón buscó expandir su imperio en Asia y el Pacífico. El ataque sorpresa a Pearl Harbor el 7 de diciembre de 1941 llevó a Estados Unidos a la guerra. Japón conquistó vastos territorios en el sudeste asiático y el Pacífico, pero fue detenido en batallas clave como Midway (1942) y Guadalcanal. La guerra terminó después de que Estados Unidos lanzara bombas atómicas sobre Hiroshima y Nagasaki en agosto de 1945, llevando a la rendición incondicional de Japón.",
      "level": 2,
      "parentId": "axis",
      "position": { "x": 0, "y": 0 },
      "children": [],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "major-battles": {
      "id": "major-battles",
      "title": "Batallas Principales",
      "description": "La Segunda Guerra Mundial vio algunas de las batallas más grandes y sangrientas de la historia. Estas batallas decisivas cambiaron el curso de la guerra y determinaron el destino de naciones enteras. Desde los combates urbanos devastadores hasta los enfrentamientos navales masivos, estas batallas involucraron millones de soldados y resultaron en pérdidas humanas sin precedentes.",
      "level": 1,
      "parentId": "root",
      "position": { "x": 0, "y": 0 },
      "children": ["stalingrad", "normandy", "midway"],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "stalingrad": {
      "id": "stalingrad",
      "title": "Batalla de Stalingrado",
      "description": "La Batalla de Stalingrado (agosto 1942 - febrero 1943) fue uno de los puntos de inflexión más importantes de la guerra. Las fuerzas alemanas intentaron capturar la ciudad industrial soviética en el río Volga. Después de meses de combates brutales urbanos, el Ejército Rojo rodeó y destruyó el 6º Ejército alemán. La batalla resultó en aproximadamente 2 millones de víctimas y marcó el comienzo del retroceso alemán en el Frente Oriental. Fue considerada una de las batallas más sangrientas de la historia.",
      "level": 2,
      "parentId": "major-battles",
      "position": { "x": 0, "y": 0 },
      "children": [],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "normandy": {
      "id": "normandy",
      "title": "Desembarco de Normandía",
      "description": "El Día D (6 de junio de 1944) fue la invasión aliada más grande por mar en la historia. Operación Overlord involucró el desembarco de más de 150,000 soldados aliados en cinco playas de Normandía, Francia. A pesar de las fuertes defensas alemanas y numerosas bajas, los Aliados establecieron una cabeza de playa exitosa. Esta operación abrió el Frente Occidental y comenzó la liberación de Europa Occidental de la ocupación nazi. Fue un logro monumental de planificación militar, coordinación y valentía.",
      "level": 2,
      "parentId": "major-battles",
      "position": { "x": 0, "y": 0 },
      "children": [],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    },
    "midway": {
      "id": "midway",
      "title": "Batalla de Midway",
      "description": "La Batalla de Midway (4-7 de junio de 1942) fue el punto de inflexión de la Guerra del Pacífico. La armada estadounidense, utilizando inteligencia descifrada, tendió una emboscada a la flota japonesa cerca del atolón de Midway. Estados Unidos hundió cuatro portaaviones japoneses, destruyendo la capacidad ofensiva de Japón en el Pacífico. Esta victoria estratégica cambió el equilibrio de poder naval y puso a Japón a la defensiva por el resto de la guerra. Demostró la importancia crucial de los portaaviones y la guerra aeronaval moderna.",
      "level": 2,
      "parentId": "major-battles",
      "position": { "x": 0, "y": 0 },
      "children": [],
      "isExpanded": false,
      "isVisible": false,
      "createdAt": 1729554000000,
      "updatedAt": 1729554000000
    }
  },
  "actions": []
}
